meal = "пицца"
price = 120

while True:
        print( meal, "стоимость", price)
        print(" 1 - добавить сыр(+50)")
        print("2- добавить грибы(+40)")
        print("3 -добавить ананас(+70)")
        print("4 -рассчитать и выйти")
        print("5 - Влад савельев")
        act = input("ваше действие:")
        if act == "1":
            price += 50
            meal += "с сыром"
        elif act == "2":
            price += 40
            meal += "с грибами"
        elif act == "3":
            price += 70
            meal += "с ананасам"
        elif act == "4":
            print("заказ завершён, итог:", meal, price)
            break
        elif act == "5":
            price += 1647153725157341623423213452134234234234324234243243243234324323432343234324324323432345678765432345678965432521356642154358213456213
            meal += "Влад Савельев"
        else:
            meal = "Пицца"
            price = 120
            print("сброшено")

